#include "view_Engine.h"
#include<iostream>
#include<cstdio>

using namespace std;

void menu_Main()
{
	cout << "请选择您想要做的：\n";
	cout << "************************\n";
	cout << "******1.增加联系人******\n";
	cout << "******2.删除联系人******\n";
	cout << "******3.修改联系人******\n";
	cout << "******4.查询联系人******\n";
	cout << "******5.退出通讯录******\n";
	cout << "************************\n";
}

void menu_add()
{
	printf("请按照: \"姓名 电话 性别 地址 年龄\"的顺序来输入联系人\n\
	其中年龄用数字表示,男为1,女为2,保密为0\n\
	例如: 张三 12345678910 1 中国 30");
}

void menu_del()
{
	cout << "请选择用何种引索删除目标联系人\n";
	cout << "******************\n";
	cout << "******1.姓名******\n";
	cout << "******2.电话******\n";
	cout << "******************\n";
}

void menu_find()
{
	cout << "请选择用何种引索查找目标联系人\n";
	cout << "******************\n";
	cout << "******1.姓名******\n";
	cout << "******2.电话******\n";
	cout << "******************\n";
}

void menu_change()
{
	cout << "请选择用何种引索寻找目标联系人\n";
	cout << "******************\n";
	cout << "******1.姓名******\n";
	cout << "******2.电话******\n";
	cout << "******************\n";
	cout << "并在这之后输入按照: \"姓名 电话 性别 地址 年龄\"的顺序来输入联系人\n";
}
